&НаКлиенте
Процедура ДатаПриИзменении(Элемент)    
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.ТоварыНаСклад Цикл
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура);    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладНоменклатураПриИзменении(Элемент) 
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура);    
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладЦенаПриИзменении(Элемент)
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

 &НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Итого = Объект.ТоварыНаСклад.Итог("Сумма");
КонецПроцедуры

