&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
	Для Каждого СтрокаУстановки Из Объект.Установка Цикл
        СтрокаУстановки.Наценка = Объект.НаценкаР;  
		СтрокаУстановки.НоваяЦенаРозничная = СтрокаУстановки.НоваяЦенаЗакупочная * (1 + СтрокаУстановки.Наценка / 100);
	КонецЦикла;
    Элементы.Установка.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаНоваяЦенаРозничнаяПриИзменении(Элемент)
	Для Каждого СтрокаУстановки Из Объект.Установка Цикл
		Если СтрокаУстановки.НоваяЦенаЗакупочная <> 0 Тогда
			СтрокаУстановки.Наценка = (СтрокаУстановки.НоваяЦенаРозничная / СтрокаУстановки.НоваяЦенаЗакупочная - 1) * 100;
        Иначе
            СтрокаУстановки.Наценка = 0;
        КонецЕсли;
    КонецЦикла;
    Элементы.Установка.Обновить();
КонецПроцедуры
