
Процедура ОбработкаПроведения(Отказ, Режим)	
	Движения.ДвиженияТоваров.Записывать = Истина;
	Движения.ПродажиОборот.Записывать = Истина;
	Для Каждого ТекСтрокаЧек Из Чек Цикл
		Движение = Движения.ДвиженияТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.НоменклатураР = ТекСтрокаЧек.Номенклатура;
		Движение.Количество = ТекСтрокаЧек.Количество;    
		
		Движение = Движения.ПродажиОборот.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураО = ТекСтрокаЧек.Номенклатура;
		Движение.Количество = ТекСтрокаЧек.Количество;    
		Движение.Сумма = ТекСтрокаЧек.Сумма;
	КонецЦикла;
	
	Движения.Записать();
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
    Запрос3 = Новый Запрос;
    Запрос3.Текст = "ВЫБРАТЬ
                    |   ДвиженияТоваровОстатки.НоменклатураР КАК Номенклатура,
                    |   ДвиженияТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
                    |ИЗ
                    |   РегистрНакопления.ДвиженияТоваров.Остатки КАК ДвиженияТоваровОстатки
                    |ГДЕ
                    |   ДвиженияТоваровОстатки.КоличествоОстаток < 0";   
    
    РезультатЗапроса = Запрос3.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	        Сообщить("Не хватает " + Строка(-ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц(ы) номенклатуры """ + ВыборкаДетальныеЗаписи.Номенклатура + """");
	        Отказ = Истина;
	    КонецЦикла;
	КонецЕсли;
КонецПроцедуры