
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Инвентаризация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инвентаризация.Дата,
	|	Инвентаризация.Номер,
	|	Инвентаризация.НоменклатураТ.(
	|		НомерСтроки,
	|		Номенклатура,
	|		УчетноеКоличество,
	|		Разница,
	|		ФактическоеКоличество
	|	)
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНоменклатураТШапка = Макет.ПолучитьОбласть("НоменклатураТШапка");
	ОбластьНоменклатураТ = Макет.ПолучитьОбласть("НоменклатураТ");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНоменклатураТШапка);
		ВыборкаНоменклатураТ = Выборка.НоменклатураТ.Выбрать();
		Пока ВыборкаНоменклатураТ.Следующий() Цикл
			ОбластьНоменклатураТ.Параметры.Заполнить(ВыборкаНоменклатураТ);
			ТабДок.Вывести(ОбластьНоменклатураТ, ВыборкаНоменклатураТ.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
