//Процедура ОбработкаПроведения(Отказ)
//	
//	Движения.ДвиженияТоваров.Очистить();
//	
//	Для Каждого Строка Из НоменклатураТ Цикл
//		Если Строка.Разница >= 0 Тогда		        
//	        ДвижениеЗапись = Движения.ДвиженияТоваров.Добавить();
//	        ДвижениеЗапись.Период = Дата;
//	        ДвижениеЗапись.Номенклатура = Строка.Номенклатура;
//	        ДвижениеЗапись.Количество = Строка.ФактическоеКоличество; 
//		
//		КонецЕсли;
//	КонецЦикла;  
//	
//	Движения.ДвиженияТоваров.Записать();
//КонецПроцедуры        
// 

//&НаСервере
//Процедура ОбновитьОстатки(ТаблицаДанных) Экспорт
//    НаборЗаписей = РегистрыНакопления.ДвиженияТоваров.СоздатьНаборЗаписей();
//    НаборЗаписей.Регистратор = Ссылка;
//    
//    Для Каждого Строка Из ТаблицаДанных Цикл
//        Если Строка.ПересчитатьОстатки Тогда
//            ЗаписьЗапись = НаборЗаписей.Добавить();
//            ЗаписьЗапись.Период = Дата;
//            ЗаписьЗапись.Номенклатура = Строка.Номенклатура;
//            ЗаписьЗапись.Количество = Строка.ФактическоеКоличество;
//        КонецЕсли;
//    КонецЦикла;

//    НаборЗаписей.Записать();
//КонецПроцедуры