
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоставляемаяНоменклатура.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемаяНоменклатура.Дата,
	|	ПоставляемаяНоменклатура.Итого,
	|	ПоставляемаяНоменклатура.Магазин,
	|	ПоставляемаяНоменклатура.Номер,
	|	ПоставляемаяНоменклатура.Поставщик,
	|	ПоставляемаяНоменклатура.Принимающий,
	|	ПоставляемаяНоменклатура.Склад,
	|	ПоставляемаяНоменклатура.Поставка.(
	|		НомерСтроки,
	|		НоменклатураСПР,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПоставляемаяНоменклатура КАК ПоставляемаяНоменклатура
	|ГДЕ
	|	ПоставляемаяНоменклатура.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоставкаШапка = Макет.ПолучитьОбласть("ПоставкаШапка");
	ОбластьПоставка = Макет.ПолучитьОбласть("Поставка");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПоставкаШапка);
		ВыборкаПоставка = Выборка.Поставка.Выбрать();
		Пока ВыборкаПоставка.Следующий() Цикл
			ОбластьПоставка.Параметры.Заполнить(ВыборкаПоставка);
			ТабДок.Вывести(ОбластьПоставка, ВыборкаПоставка.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
