&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ДвиженияТоваров.Записывать = Истина;
    ДатаДокумента = ЭтотОбъект.Дата;

    Для Каждого ТекСтрокаПоставка Из Поставка Цикл
        
        Движение = Движения.ДвиженияТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = ДатаДокумента;
        Движение.НоменклатураР = ТекСтрокаПоставка.Номенклатура;
        Движение.Количество = ТекСтрокаПоставка.Количество;

    КонецЦикла;
КонецПроцедуры