
&НаКлиенте
Процедура ПоставкаЦенаПриИзменении(Элемент)
	СТЧ = Элементы.Поставка.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ПоставкаКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.Поставка.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СТЧ = Элементы.Поставка.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.Поставка Цикл   
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
	КонецЦикла
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СТЧ = Элементы.Поставка.ТекущиеДанные;
	Объект.Итого = Объект.Поставка.Итог("Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ПоставкаНоменклатураПриИзменении(Элемент)
	СТЧ = Элементы.Поставка.ТекущиеДанные;       
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

