Функция ПодстановкаЗакупочнойЦены(АктуальнаяДата, ЭлементНоменклатуры) Экспорт     
Отбор = Новый Структура("НоменклатураСПР", ЭлементНоменклатуры);   
ЗначенияРесурсов = РегистрыСведений.ЦеныНаНоменклатуру.ПолучитьПоследнее
																(АктуальнаяДата, Отбор);
Возврат     

ЗначенияРесурсов.ЗакупочнаяЦена

КонецФункции  

Функция ПодстановкаНовойЦены(АктуальнаяДата, ЭлементНоменклатуры) Экспорт     
Отбор = Новый Структура("НоменклатураСПР", ЭлементНоменклатуры);   
ЗначенияРесурсов = РегистрыСведений.ЦеныНаНоменклатуру.ПолучитьПоследнее
																(АктуальнаяДата, Отбор);
Возврат     

ЗначенияРесурсов.НоваяЦена

КонецФункции