&НаКлиенте
Процедура НоменклатураТНоменклатураПриИзменении(Элемент)
    СТЧ = Элементы.НоменклатураТ.ТекущиеДанные;

    Если СТЧ.НоменклатураСПР = Неопределено Тогда
        СТЧ.УчетноеКоличество = 0;
        СТЧ.Разница = 0;
        Возврат;
    КонецЕсли;

    Остаток = ПолучитьОстатокНоменклатурыНаСервере(СТЧ.НоменклатураСПР);
    СТЧ.УчетноеКоличество = Остаток;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьОстатокНоменклатурыНаСервере(Номенклатура)
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   КоличествоОстаток
    |ИЗ
    |   РегистрНакопления.ДвиженияТоваров.Остатки(&Дата) КАК ДвиженияТоваров
    |ГДЕ
    |   ДвиженияТоваров.НоменклатураСПР = &НоменклатураСПР";

    Запрос.УстановитьПараметр("Дата", ТекущаяДата());
    Запрос.УстановитьПараметр("НоменклатураСПР", Номенклатура);

    Результат = Запрос.Выполнить().Выгрузить();

    Если Результат.Количество() > 0 Тогда
        Возврат Результат[0].КоличествоОстаток;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НоменклатураТНовоеКоличествоПриИзменении(Элемент)
    СТЧ = Элементы.НоменклатураТ.ТекущиеДанные;
    СТЧ.Разница = СТЧ.ФактическоеКоличество - СТЧ.УчетноеКоличество;
КонецПроцедуры