&НаКлиенте
Процедура ПриходНоменклатураКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ); 
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ПриходНоменклатураЦенаПриИзменении(Элемент)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные; 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);    
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.ПриходНоменклатура Цикл    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ);  
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;
	Объект.Итого = Объект.ПриходНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьЦены(Команда)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;   
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура); 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры
