&НаКлиенте
Процедура ОбновитьЦены()
    Наценка = ?(Запись.Наценка = Неопределено ИЛИ Запись.Наценка < 0, 32, Запись.Наценка);

    НоваяЦена = Запись.ЗакупочнаяЦена * (1 + Наценка / 100);

    ПроцентИзмененияЦены = (НоваяЦена - Запись.ЗакупочнаяЦена) / Запись.ЗакупочнаяЦена * 100;

    Запись.Наценка = Наценка;
    Запись.НоваяЦена = НоваяЦена;
    Запись.ПроцентИзмененияЦены = ПроцентИзмененияЦены;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупочнаяЦенаПриИзменении(Элемент)
    ОбновитьЦены();
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
    ОбновитьЦены();
КонецПроцедуры
