
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);   
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СТЧ = Элементы.Товары.ТекущиеДанные; 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);  
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.Товары Цикл    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ); 
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	Объект.ИтоговаяСумма = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписатьПоЗакупочнойЦене(Команда)  
	СТЧ = Элементы.Товары.ТекущиеДанные;
	СТЧ.Цена = ИнвентаризацияОМ.ПодстановкаЗакупочнойЦены(Объект.Дата, СТЧ.Номенклатура); 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура СписатьПоРозничнойЦене(Команда)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	СТЧ.Цена = ИнвентаризацияОМ.ПодстановкаНовойЦены(Объект.Дата, СТЧ.Номенклатура);
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры




