
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЦеныНаНоменклатуруПоНакладным.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНаНоменклатуруПоНакладным.Дата,
	|	ЦеныНаНоменклатуруПоНакладным.ДокументОснование,
	|	ЦеныНаНоменклатуруПоНакладным.Номер,
	|	ЦеныНаНоменклатуруПоНакладным.Накладная.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ЦеноваяГруппа,
	|		СтараяЦенаЗакупочная,
	|		ПроцентИзменения,
	|		НоваяЦенаЗакупочная,
	|		Упаковка,
	|		СтараяЦенаРозничная,
	|		ПроцентИзмененияСтаройЦены,
	|		Наценка,
	|		НоваяЦенаРозничная,
	|		УпаковкаЕд
	|	)
	|ИЗ
	|	Документ.ЦеныНаНоменклатуруПоНакладным КАК ЦеныНаНоменклатуруПоНакладным
	|ГДЕ
	|	ЦеныНаНоменклатуруПоНакладным.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНакладнаяШапка = Макет.ПолучитьОбласть("НакладнаяШапка");
	ОбластьНакладная = Макет.ПолучитьОбласть("Накладная");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНакладнаяШапка);
		ВыборкаНакладная = Выборка.Накладная.Выбрать();
		Пока ВыборкаНакладная.Следующий() Цикл
			ОбластьНакладная.Параметры.Заполнить(ВыборкаНакладная);
			ТабДок.Вывести(ОбластьНакладная, ВыборкаНакладная.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
