
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УстановкаЦен.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаЦен.Дата,
	|	УстановкаЦен.НаценкаР,
	|	УстановкаЦен.Номер,
	|	УстановкаЦен.Установка.(
	|		НомерСтроки,
	|		НоменклатураД,
	|		СтараяЦенаЗакупочная,
	|		ПроцентИзмененияСтаройЦены,
	|		НоваяЦенаЗакупочная,
	|		СтараяЦенаРозничная,
	|		Наценка,
	|		НоваяЦенаРозничная
	|	)
	|ИЗ
	|	Документ.УстановкаЦен КАК УстановкаЦен
	|ГДЕ
	|	УстановкаЦен.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУстановкаШапка = Макет.ПолучитьОбласть("УстановкаШапка");
	ОбластьУстановка = Макет.ПолучитьОбласть("Установка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУстановкаШапка);
		ВыборкаУстановка = Выборка.Установка.Выбрать();
		Пока ВыборкаУстановка.Следующий() Цикл
			ОбластьУстановка.Параметры.Заполнить(ВыборкаУстановка);
			ТабДок.Вывести(ОбластьУстановка, ВыборкаУстановка.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
