
&НаКлиенте
Процедура ЧекКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.Чек.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЧекЦенаПриИзменении(Элемент)
	СТЧ = Элементы.Чек.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЧекНоменклатураПриИзменении(Элемент)
	СТЧ = Элементы.Чек.ТекущиеДанные;    
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура);    
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СТЧ = Элементы.Чек.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.Чек Цикл
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура);    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СТЧ = Элементы.Чек.ТекущиеДанные;
	Объект.Итого = Объект.Чек.Итог("Сумма");
КонецПроцедуры
