
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходПоИнвентаризации.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходПоИнвентаризации.Дата,
	|	ПриходПоИнвентаризации.Итого,
	|	ПриходПоИнвентаризации.Номер,
	|	ПриходПоИнвентаризации.ПриходНоменклатура.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПриходПоИнвентаризации КАК ПриходПоИнвентаризации
	|ГДЕ
	|	ПриходПоИнвентаризации.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПриходНоменклатураШапка = Макет.ПолучитьОбласть("ПриходНоменклатураШапка");
	ОбластьПриходНоменклатура = Макет.ПолучитьОбласть("ПриходНоменклатура");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПриходНоменклатураШапка);
		ВыборкаПриходНоменклатура = Выборка.ПриходНоменклатура.Выбрать();
		Пока ВыборкаПриходНоменклатура.Следующий() Цикл
			ОбластьПриходНоменклатура.Параметры.Заполнить(ВыборкаПриходНоменклатура);
			ТабДок.Вывести(ОбластьПриходНоменклатура, ВыборкаПриходНоменклатура.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
