
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВозвратТоваровНаСклад.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратТоваровНаСклад.Дата,
	|	ВозвратТоваровНаСклад.Итого,
	|	ВозвратТоваровНаСклад.Клиент,
	|	ВозвратТоваровНаСклад.Номер,
	|	ВозвратТоваровНаСклад.ТоварыНаСклад.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Причина
	|	)
	|ИЗ
	|	Документ.ВозвратТоваровНаСклад КАК ВозвратТоваровНаСклад
	|ГДЕ
	|	ВозвратТоваровНаСклад.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыНаСкладШапка = Макет.ПолучитьОбласть("ТоварыНаСкладШапка");
	ОбластьТоварыНаСклад = Макет.ПолучитьОбласть("ТоварыНаСклад");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыНаСкладШапка);
		ВыборкаТоварыНаСклад = Выборка.ТоварыНаСклад.Выбрать();
		Пока ВыборкаТоварыНаСклад.Следующий() Цикл
			ОбластьТоварыНаСклад.Параметры.Заполнить(ВыборкаТоварыНаСклад);
			ТабДок.Вывести(ОбластьТоварыНаСклад, ВыборкаТоварыНаСклад.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
