
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвиженияТоваров Приход
	Движения.ДвиженияТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыКлиенту Из ТоварыНаСклад Цикл
		Движение = Движения.ДвиженияТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.НоменклатураР = ТекСтрокаТоварыКлиенту.Номенклатура;
		Движение.Количество = ТекСтрокаТоварыКлиенту.Количество;

	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажи") Тогда
		// Заполнение шапки
		Итого = ДанныеЗаполнения.Итого;
		Клиент = ДанныеЗаполнения.Клиент;
		Для Каждого ТекСтрокаЧек Из ДанныеЗаполнения.Чек Цикл
			НоваяСтрока = ТоварыНаСклад.Добавить();
			НоваяСтрока.Количество = ТекСтрокаЧек.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаЧек.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаЧек.Сумма;
			НоваяСтрока.Цена = ТекСтрокаЧек.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
